app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date desc
---
  def index
    session[:selected_ratings] ||= Hash.new
    session[:selected_order] ||= ""
    @classHilite = {"title" =>"","release_date"=>""}
    if(params.size == 2)
      params[:order]   ||= session[:selected_order]
      params[:ratings] ||= session[:selected_ratings]
      redirect_to movies_path(params) and return
    end

    @all_ratings = Movie.getRatings
    if !params[:ratings].nil?
      session[:selected_ratings] = params[:ratings]
    elsif !params[:commit].nil?
      session[:selected_ratings] = Hash.new
    end

    @selected_ratings = session[:selected_ratings]

    if !params[:order].nil?
      session[:selected_order] = params[:order]
    end

    order = (session[:selected_order] == "")?"title":session[:selected_order]
    if session[:selected_order] != ""
      @classHilite = {session[:selected_order]=>"hilite"}
    end

    #Gets all the movies order by 'order' (Default is title)
    @movies = Movie.order("#{order}")